Tekla Open API Reference for Tekla Structures 2025
ShapeUpAxis Enumeration
 Up axis direction
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ShapeUpAxis
Public Enumeration ShapeUpAxis
Members
Member name | Value | Description
Undefined | 0 |  Undefined direction for axis. Should not be used in input.
X_Axis | 1 |  X points up.
Y_Axis | 2 |  Y points up.
Z_Axis | 3 |  Z points up.
See Also
Reference
Tekla.Structures.Catalogs Namespace